Tekla Open API Reference for Tekla Structures 2025
Seam.GetStartAndEndPositions Method
 Returns the start and end points of the seam.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetStartAndEndPositions(
	ref Point StartPoint,
	ref Point EndPoint
)
Public Function GetStartAndEndPositions (
	ByRef StartPoint As Point,
	ByRef EndPoint As Point
) As Boolean
Parameters
StartPoint
Type: Tekla.Structures.Geometry3d.Point
The start point of the seam.
EndPoint
Type: Tekla.Structures.Geometry3d.Point
The end point of the seam.
Return Value
Type: Boolean
True on success.
See Also
Reference
Seam Class
Tekla.Structures.Model Namespace